<?PHP
echo 'PostgreSQL(ポスグレ)<br>
　リレー所なるデータベース（RDB）の作成や、操作、管理ができるオープンソースのデータベース管理システム（DBMS）の一つ。MySQLと人気を二分するオープンソースRDBMSで、Linuxなど主要なUnix系OSとwindowsに対応し、機能の豊富さ拡張性の高さに定評がある。<br>
　データベースの問い合わせ言語として、SQLを採用している。SQL92に準拠し、SQL99にも一部対応している。データベースのデータを複数のディスクに分割してディスクI/Oの負担軽減を図る「テーブル・スペース」や1つのテーブルのデータ量が多くなると性能劣化が起こるためテーブル内のレコードを疑似的に分割する「テーブル・パーティショニング」など、大規模システム向けの機能も多数搭載されている。<br>
<br>oracleSQL<br>
　米オラクルが開発した、SQLで、oracle dartabaseにおいて、様々な手続きの処理を行うために用いる。PL/SQLはSQLを手続き型言語として拡張したプログラミング言語。<br>

<br>Oracle databaseを使用するシステム開発では、プログラミング言語PL/SQLを使うことで、<br>
	パフォーマンスに優れている。<br>
	SQLとの親和性が高い。<br>
	移植性に優れている。<br>
	プログラムをデータベースに格納して必要な時に呼び出せる。<br>
 などのメリットがある。<br>

<br>TortoiseGIt<br>
　Gitをより扱いやすくするために開発されたWindows用のソフトウェア。無料で扱うことができ、コマンドを打ち込んで実行するというハードルをtortoisegitが解消する。<br>
　Tortoisegitを使えば、ファイルを右クリックして、ファイルの追加、コミットができたり、プッシュもできるようになる。そういった基本操作だけでなく、ブランチの作成やマージも一通りの作業をマウスだけでできる。<br>

<br>TOrtoiseSVN<br>
　Subversionのクライアントフロントエンド（各種入力をユーザーから受け取り、バックエンドが使える仕様に合うようにそれを加工する役目を担う）となるソフトウェア。<br>
　
<br>外部設計<br>
　基本設計とも呼ばれ、一般的に外部設計までが上流工程に含まれる。要件定義で決定した機能や性能、制約条件苗雄を基にしてシステムの基本となる設計を行う。操作画面や操作方法、データの出力など、ユーザーから見えるインターフェース部分の仕様を決定したリ、セキュリティや運用規定、システム開発のスケジュールや費用などを設計したりと、基本的にユーザーに向けられた仕様を設計するのが外部設計。<br>

<br>内部設計<br>
　外部設計を基に、システム内部の動作や機能、物理データなど、ユーザーから見えにくい詳細な部分の設計を行う。外部設計とその後に行われる詳細決定の間の工程だが、内部システムに特化しているため、詳細設計と同じ工程として扱われることもある。<br>
　プログラムの機能を単体に分割し、そこで使用する物理データや入出力を設計する。外部設計の結果をプログラミングしやすくするのが内部設計の役割。<br>';
?>