<?php
echo 'cakePHPの2系・3系の違い<br>
	Composerと名前空間の利用：Composerの利用が標準的になり、cakePHPプロジェクトの作成自身もcomposerにより行うように変更される。また、2系では、Appクラスを利用した独自のパス管理やローディングを行っていたが、3系からはPSR-4に基づいたなまえくうかんを利用するようになる。<br>
	パフォーマンスの向上：ブートストラップ、ルーティング作成などにおいて改善<br>
	セッション管理の改善<br>
	ビューセルの追加<br>
	Testshellの廃止<br>

<br>LAMP（Linux, Apache, MySQL, PHP/Perl/Python）<br>
　LAMPとは、データベースと利用したWebアプリケーション開発・運用するのに適した、人気の高いオープンソースソフトウェアの組み合わせの一つ。左から順に、OS、Webサーバーソフト、データベース管理システム、スクリプト言語の頭文字。いずれもオープンソースで開発・配布されていて、動的なウWebサイトやWebサービスなどの構築に適していて、関連情報や事例も豊富。<br>
　LAMPのほかに、スクリプト言語にPHPとPerlのどちらも採用した場合にLAMPP、Linuxを利用しないシステムではAMP、MySQLの代わりに同じくデータベース管理システムのPostgreSQLを使ったLAPPなども使われる。<br>

<br>AWS(Amazon Web Services)<br>
　AWSはアマゾンドットコム社が事業者向けに提供しているクラウドサービス。企業などが情報システムの運用やオンラインサービスの運営のために必要とするITインフラや様々な個別の情報処理機能を、インターネットを通じてサービスとして販売している。<br>
　同社の世界規模のECサイト（オンラインショップ）の運営基盤として使用しているコンピュータシステムやその機能をネットワークを通じてサービスとして従量制で提供するもので、仮想サーバーなどを貸し出すIaaS(Infrastructure as a Service)型や、アプリケーション実行環境を提供するPaaS(Platform as a Service)型、固有の機能を持つソフトウェアを利用させるSaaS(Softwar as a Service)型のそれぞれについて様々なサービスを用意している。<br>
　今日ふぉうとしてはGoogle社の「Google Cloud Platform」（GCP）やMicrosoft社の「Microsoft Azure」IBM社の「IBM　Cloud」などの世界的IT大手や、特定の地域で強みを持つサービス（アリババグループの「Alibaba Cloud」）があるが、AWSはこれらを抑えて、世界的に高いシェアで、クラウドサービスのマーケットリーダー的存在として知られる。<br>';
?>