<?php
echo 'モジュール<br>
　機能単位、交換可能な構成部分などを意味する英単語。機器やシステムの一部を構成するひとまとまりの機能を持った部品で、システムの中核部分や他の部品への接合部（インターフェース）の仕様が明確に定義され、容易に追加やこうかんができるようなものを指す。<br>
　このように、構成単位を組み合わせて全体を構成する手法をモジュラー型設計という。モジュール単位で容易に交換でき、モジュール内部の設計や実装の詳細を他のモジュールや全体の設計者が知る必要がない（ブラックボックス化）ため、要素ごとの分業や専門化が可能となる。<br>

<br>バージョン管理システム（VSC）<br>
　ファイルの変更履歴の保存、管理を行うソフトウェア。管理下のファイルについて、過去の版の参照や、複数の版の比較、差分の検出などを行うことができる。<Br>
　主に管理されるのはテキストファイルで、ソフトウェア開発においてコンピュータプログラムのソースコードを管理するのに用いられることが多い。仕様上は、バイナリファイルを含む任意の形式のファイルを登録できるようになっていることが多い。<br>
　ファイルシステムと同様に、複数のファイルを階層的なディレクトリに整理でき、全体をまとめてプロジェクトとして管理することもできる。ファイルとその変更履歴やバー上ん番号などの管理情報は「リポジトリ」と呼ばれる一種のデータベースにまとめて集積される。<br>
　
<Br>サブクエリ<br>
　データベースなどの問い合わせ（クエリ）分の内部に含まれる、別の問い合わせ分のこと。サブクエリの結果を反映したクエリを実行することができる。<br>
　よく用いられるのは、SQLのselect文を利用したサブクエリ。SELECT分やほかの様々な文の中に別のSELECT分をサブクエリとして埋め込み、そのじっこうけっかを条件や対象を記述する際の値として用いる。サブクエリを用いると、データをいったん制御プログラムに引き取って処理しなくても、1つのクエリの記述・実行だけで多様な処理を行うことができるが。処理の負荷が大きく実行に時間がかかることが多い。<br>';
?>